jasonwaseq/GenX320_STM32F7_Stream/Core/Src/main.c

/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file           : main.c
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; Copyright (c) 2020 STMicroelectronics.
 * All rights reserved.</center></h2>
 *
 * This software component is licensed by ST under Ultimate Liberty license
 * SLA0044, the "License"; You may not use this file except in compliance with
 * the License. You may obtain a copy of the License at:
 *                             www.st.com/SLA0044
 *
 ******************************************************************************
 */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "cmsis_os.h"
#include "app_touchgfx.h"
#include "usb_device.h"
#include "task_decoder.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <stm32746g_discovery_qspi.h>
#include <touchgfx/hal/Config.hpp>
#include "task_usb_enum.h"

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

#define REFRESH_COUNT        1835

#define SDRAM_TIMEOUT                            ((uint32_t)0xFFFF)
#define SDRAM_MODEREG_BURST_LENGTH_1             ((uint16_t)0x0000)
#define SDRAM_MODEREG_BURST_LENGTH_2             ((uint16_t)0x0001)
#define SDRAM_MODEREG_BURST_LENGTH_4             ((uint16_t)0x0002)
#define SDRAM_MODEREG_BURST_LENGTH_8             ((uint16_t)0x0004)
#define SDRAM_MODEREG_BURST_TYPE_SEQUENTIAL      ((uint16_t)0x0000)
#define SDRAM_MODEREG_BURST_TYPE_INTERLEAVED     ((uint16_t)0x0008)
#define SDRAM_MODEREG_CAS_LATENCY_2              ((uint16_t)0x0020)
#define SDRAM_MODEREG_CAS_LATENCY_3              ((uint16_t)0x0030)
#define SDRAM_MODEREG_OPERATING_MODE_STANDARD    ((uint16_t)0x0000)
#define SDRAM_MODEREG_WRITEBURST_MODE_PROGRAMMED ((uint16_t)0x0000)
#define SDRAM_MODEREG_WRITEBURST_MODE_SINGLE     ((uint16_t)0x0200)

#define PUTCHAR_PROTOTYPE int __io_putchar(int ch)
#define STATIC_HEAP_SIZE (1024)
#define ALIGN_FLOOR(addr, type) (((uint32_t)(addr)) & ~(uint32_t)(sizeof(type)-1))
#define ALIGN_CEIL(addr, type)   ALIGN_FLOOR((uint32_t)(addr) + sizeof(type) - 1, type)

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

CRC_HandleTypeDef hcrc;

DCMI_HandleTypeDef hdcmi;
DMA_HandleTypeDef hdma_dcmi;

DMA2D_HandleTypeDef hdma2d;

I2C_HandleTypeDef hi2c1;
I2C_HandleTypeDef hi2c3;

LTDC_HandleTypeDef hltdc;

QSPI_HandleTypeDef hqspi;

TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim2;

DMA_HandleTypeDef hdma_memtomem_dma2_stream0;
SDRAM_HandleTypeDef hsdram1;

/* Definitions for ESP_LPW */
osThreadId_t ESP_LPWHandle;
const osThreadAttr_t ESP_LPW_attributes = {
  .name = "ESP_LPW",
  .stack_size = 256 * 4,
  .priority = (osPriority_t) osPriorityNormal,
};
/* Definitions for TouchGFXTask */
osThreadId_t TouchGFXTaskHandle;
const osThreadAttr_t TouchGFXTask_attributes = {
  .name = "TouchGFXTask",
  .stack_size = 4096 * 4,
  .priority = (osPriority_t) osPriorityNormal2,
};
/* Definitions for Update_Fb */
osThreadId_t Update_FbHandle;
const osThreadAttr_t Update_Fb_attributes = {
  .name = "Update_Fb",
  .stack_size = 512 * 4,
  .priority = (osPriority_t) osPriorityAboveNormal,
};
/* Definitions for Event_Decoding */
osThreadId_t Event_DecodingHandle;
const osThreadAttr_t Event_Decoding_attributes = {
  .name = "Event_Decoding",
  .stack_size = 256 * 4,
  .priority = (osPriority_t) osPriorityNormal3,
};
/* Definitions for Activity_Map */
osThreadId_t Activity_MapHandle;
const osThreadAttr_t Activity_Map_attributes = {
  .name = "Activity_Map",
  .stack_size = 256 * 4,
  .priority = (osPriority_t) osPriorityNormal1,
};
/* Definitions for Statistics */
osThreadId_t StatisticsHandle;
const osThreadAttr_t Statistics_attributes = {
  .name = "Statistics",
  .stack_size = 256 * 4,
  .priority = (osPriority_t) osPriorityNormal1,
};
/* Definitions for Led_Tracking */
osThreadId_t Led_TrackingHandle;
const osThreadAttr_t Led_Tracking_attributes = {
  .name = "Led_Tracking",
  .stack_size = 256 * 4,
  .priority = (osPriority_t) osPriorityNormal1,
};

// for usb streaming
osThreadId_t UsbTxHandle;
const osThreadAttr_t UsbTx_attributes = {
  .name = "UsbTx",
  .stack_size = 512 * 4,
  .priority = (osPriority_t) osPriorityBelowNormal
};
// end usb streaming

/* Definitions for tskCtlUpdateFb */
osMutexId_t tskCtlUpdateFbHandle;
const osMutexAttr_t tskCtlUpdateFb_attributes = {
  .name = "tskCtlUpdateFb"
};
/* Definitions for Vsync_Semaphore */
osSemaphoreId_t Vsync_SemaphoreHandle;
const osSemaphoreAttr_t Vsync_Semaphore_attributes = {
  .name = "Vsync_Semaphore"
};
/* Definitions for ESP_LPW_Semph */
osSemaphoreId_t ESP_LPW_SemphHandle;
const osSemaphoreAttr_t ESP_LPW_Semph_attributes = {
  .name = "ESP_LPW_Semph"
};
/* Definitions for Activity_Map_Semph */
osSemaphoreId_t Activity_Map_SemphHandle;
const osSemaphoreAttr_t Activity_Map_Semph_attributes = {
  .name = "Activity_Map_Semph"
};
/* Definitions for Statistics_Semph */
osSemaphoreId_t Statistics_SemphHandle;
const osSemaphoreAttr_t Statistics_Semph_attributes = {
  .name = "Statistics_Semph"
};
/* Definitions for Led_Tracking_Semph */
osSemaphoreId_t Led_Tracking_SemphHandle;
const osSemaphoreAttr_t Led_Tracking_Semph_attributes = {
  .name = "Led_Tracking_Semph"
};
/* USER CODE BEGIN PV */
static FMC_SDRAM_CommandTypeDef Command;

/* I2C driver */
DrvI2cHandle_t drv_i2c;

/* Dma driver */
DrvDmaHandle_t drv_dma;

/* GenX320 driver */
DrvGenx320Handle_t drv_genx320;

