jasonwaseq/GenX320_STM32F7_Stream/Core/Src/main.c
/* Thread arguments. */
static void* pvStaticAllocate(size_t ulSize);

const args_update_fb_t args_update_fb = {
	.hltdc = &hltdc,
	.drv_dma = &drv_dma,
};
const args_evt_decoder_t args_evt_decoder = {
		.hdcmi = &hdcmi,
		.hdma_dcmi = &hdma_dcmi,
		.drv_genx320 = &drv_genx320,
};

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MPU_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_FMC_Init(void);
static void MX_I2C3_Init(void);
static void MX_QUADSPI_Init(void);
static void MX_I2C1_Init(void);
static void MX_DCMI_Init(void);
static void MX_CRC_Init(void);
static void MX_LTDC_Init(void);
static void MX_DMA2D_Init(void);
static void MX_TIM1_Init(void);
static void MX_TIM2_Init(void);
void ESP_LPW_Task(void *argument);
extern void TouchGFX_Task(void *argument);
void Task_Update_Fb(void *argument);
void Event_Decoding_Task(void *argument);
void Activity_Map_Task(void *argument);
void Statistics_Task(void *argument);
void Led_Tracking_Task(void *argument);

/* USER CODE BEGIN PFP */

/*
* @brief  Call back function for transmission transfer complete
*/
void HAL_I2C_MasterTxCpltCallback(I2C_HandleTypeDef *hi2c)
{
	assert(hi2c == &hi2c1);
	ucDrvI2cCallback(drv_i2c);
}

/*
* @brief  Call back function for reception transfer complete
*/
void HAL_I2C_MasterRxCpltCallback(I2C_HandleTypeDef *hi2c)
{
	assert(hi2c == &hi2c1);
	ucDrvI2cCallback(drv_i2c);
}

/*
* @brief  Call back function for DMA transfer complete
*/
void HAL_DMA_MasterCpltCallback(DMA_HandleTypeDef *hdma)
{
	assert(hdma == &hdma_memtomem_dma2_stream0);
	ucDrvDmaCallback(drv_dma);

}

/*
* @brief  For Debug Communication
*/
/*PUTCHAR_PROTOTYPE
{
	HAL_UART_Transmit(&huart1, (uint8_t *)&ch, 1, HAL_MAX_DELAY);
	return ch;
}*/

/*
 * @brief Call back function for register reload
 */
void HAL_LTDC_ReloadEventCallback(LTDC_HandleTypeDef *hltdc) {
	update_fb_callback();
}

/**
 * @brief Function to reset the frame buffers which do not belong to the .bss section.
 */
void reset_buffers() {

	/* Reset the TouchGFX Frame Buffer */
	memset((void *)GUI_BUF_ADD_1 , 0x0 , 0x3fc00);
	memset((void *)GUI_BUF_ADD_2 , 0x0 , 0xff000);

}

/**
 * @brief Function to execute the power down sequence for ULP passive mode.
 */
void ULP_standby_sequence() {

	/* Toggle OFF the RSTN */
	HAL_GPIO_WritePin(GPIOB, GPIO_PIN_15, GPIO_PIN_RESET);
	psee_sleep_us_imp(tclk_stop);

	/* Stop the 10MHz PWM signal */
	HAL_TIM_PWM_Stop(&htim1,TIM_CHANNEL_1);
	psee_sleep_us_imp(Tana_stop);

	/* Switch ON PSU_EN_2V5*/
	if(HAL_GPIO_ReadPin(GPIOH, GPIO_PIN_6) != GPIO_PIN_SET) {
		HAL_GPIO_WritePin(GPIOH, GPIO_PIN_6, GPIO_PIN_SET);
		psee_sleep_us_imp(TIO_stop);
	} else {
		psee_sleep_us_imp(TIO_stop);
	}

	/* Switch OFF PSU_EN_1V8*/
	HAL_GPIO_WritePin(GPIOI, GPIO_PIN_0, GPIO_PIN_RESET);
	psee_sleep_us_imp(Tdig_stop);

	/* Switch OFF PSU_EN_1V1*/
	HAL_GPIO_WritePin(GPIOG, GPIO_PIN_7, GPIO_PIN_RESET);
	psee_sleep_us_imp(Tulp_set);

	/* Toggle OFF ULP_ENB*/
	HAL_GPIO_WritePin(GPIOF, GPIO_PIN_8, GPIO_PIN_RESET);


}

/**
 * @brief Function to execute the power up sequence for waking up from ULP passive mode.
 */
void ULP_wakeup_sequence() {
	/* Initialize the sensor */
	const struct issd *current_issd = psee_open_evt();

	/* Set Standard biases */
	psee_sensor_set_biases(&genx320_default_biases);

	/* Start the sensor */
	psee_sensor_start(current_issd);

	/* Set Flip */
	psee_sensor_set_flip(0,0);

	/* Configure the activity map */
	psee_configure_activity_map();

	/* Toggle ON ULP_ENB*/
	HAL_GPIO_WritePin(GPIOF, GPIO_PIN_8, GPIO_PIN_SET);

}

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

static uint8_t pxStaticHeap[STATIC_HEAP_SIZE] __ALIGNED(32) = {0};

/**
 * @brief Function for Static heap allocation.
 */
static void* pvStaticAllocate(size_t ulSize)
{
	static size_t ulAllocated = 0;

    /* Align requested size on long boundaries. */
    unsigned ulAlign = (unsigned) ALIGN_CEIL(ulSize, long);

    /* Check the requested size do not exceed max size. */
    size_t ulRequested = ulAllocated + ulAlign;
    if (STATIC_HEAP_SIZE < ulRequested)
        return NULL;

    /* Return the current buffer position and update the position. */
    void *pVoid = (void *) (pxStaticHeap + ulAllocated);
    ulAllocated = ulRequested;
    return pVoid;
}

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

	/* PUT THIS FIRST, WON'T WORK OTHERWISE */
	MX_DMA_Init();

  /* USER CODE END 1 */

  /* MPU Configuration--------------------------------------------------------*/
  MPU_Config();
/* Enable the CPU Cache */

  /* Enable I-Cache---------------------------------------------------------*/
  SCB_EnableICache();

  /* Enable D-Cache---------------------------------------------------------*/
  SCB_EnableDCache();

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_FMC_Init();
  MX_I2C3_Init();
  MX_QUADSPI_Init();
  MX_I2C1_Init();
  MX_DCMI_Init();
  MX_CRC_Init();
  MX_LTDC_Init();
  MX_DMA2D_Init();
  MX_TIM1_Init();
  MX_TIM2_Init();
  MX_TouchGFX_Init();
  /* Call PreOsInit function */
  MX_TouchGFX_PreOSInit();
  /* USER CODE BEGIN 2 */

  /* Change Systick priority to 4 to use HAL_DELAY() */
  HAL_InitTick(4);
  MX_USB_DEVICE_Init();
  /* Reset the display frame buffers */
  reset_buffers();
  reset_frame_buffers();

  /* Initialize drivers */
  BaseType_t i2c_status =  xDrvI2cCreate(&hi2c1, pvStaticAllocate, &drv_i2c);
  assert(i2c_status == pdTRUE);

