jasonwaseq/GenX320_STM32F7_Stream/Core/Src/main.c
  /* USER CODE END Task_Update_Fb */
}

/* USER CODE BEGIN Header_Event_Decoding_Task */
/**
* @brief Function implementing the Event_Decoding thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_Event_Decoding_Task */
void Event_Decoding_Task(void *argument)
{
  /* USER CODE BEGIN Event_Decoding_Task */
	task_evt_decoder((args_evt_decoder_t *) argument);

  /* USER CODE END Event_Decoding_Task */
}

/* USER CODE BEGIN Header_Activity_Map_Task */
/**
 * @brief Function implementing the Activity_Map thread.
 * @param argument: Not used
 * @retval None
 */
/* USER CODE END Header_Activity_Map_Task */
void Activity_Map_Task(void *argument)
{
  /* USER CODE BEGIN Activity_Map_Task */

	psee_activity_map_task();

  /* USER CODE END Activity_Map_Task */
}

/* USER CODE BEGIN Header_Statistics_Task */
/**
* @brief Function implementing the Statistics thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_Statistics_Task */
void Statistics_Task(void *argument)
{
  /* USER CODE BEGIN Statistics_Task */

	psee_statistics_task();

  /* USER CODE END Statistics_Task */
}

/* USER CODE BEGIN Header_Led_Tracking_Task */
/**
* @brief Function implementing the Led_Tracking thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_Led_Tracking_Task */
void Led_Tracking_Task(void *argument)
{
  /* USER CODE BEGIN Led_Tracking_Task */

	psee_led_tracking_task();

  /* USER CODE END Led_Tracking_Task */
}

/* MPU Configuration */

void MPU_Config(void)
{
  MPU_Region_InitTypeDef MPU_InitStruct = {0};

  /* Disables the MPU */
  HAL_MPU_Disable();

  /** Initializes and configures the Region and the memory to be protected
  */
  MPU_InitStruct.Enable = MPU_REGION_ENABLE;
  MPU_InitStruct.Number = MPU_REGION_NUMBER0;
  MPU_InitStruct.BaseAddress = 0x90000000;
  MPU_InitStruct.Size = MPU_REGION_SIZE_256MB;
  MPU_InitStruct.SubRegionDisable = 0x0;
  MPU_InitStruct.TypeExtField = MPU_TEX_LEVEL0;
  MPU_InitStruct.AccessPermission = MPU_REGION_FULL_ACCESS;
  MPU_InitStruct.DisableExec = MPU_INSTRUCTION_ACCESS_ENABLE;
  MPU_InitStruct.IsShareable = MPU_ACCESS_NOT_SHAREABLE;
  MPU_InitStruct.IsCacheable = MPU_ACCESS_NOT_CACHEABLE;
  MPU_InitStruct.IsBufferable = MPU_ACCESS_NOT_BUFFERABLE;

  HAL_MPU_ConfigRegion(&MPU_InitStruct);

  /** Initializes and configures the Region and the memory to be protected
  */
  MPU_InitStruct.Number = MPU_REGION_NUMBER1;
  MPU_InitStruct.Size = MPU_REGION_SIZE_16MB;
  MPU_InitStruct.IsCacheable = MPU_ACCESS_CACHEABLE;

  HAL_MPU_ConfigRegion(&MPU_InitStruct);
  /* Enables the MPU */
  HAL_MPU_Enable(MPU_PRIVILEGED_DEFAULT);

}

/**
  * @brief  Period elapsed callback in non blocking mode
  * @note   This function is called  when TIM6 interrupt took place, inside
  * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
  * a global variable "uwTick" used as application time base.
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  /* USER CODE BEGIN Callback 0 */

  /* USER CODE END Callback 0 */
  if (htim->Instance == TIM6) {
    HAL_IncTick();
  }
  /* USER CODE BEGIN Callback 1 */

  /* USER CODE END Callback 1 */
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
	/* User can add his own implementation to report the HAL error return state */

  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
	/* User can add his own implementation to report the file name and line number,
     tex: // printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
